<a href="https://colab.research.google.com/github/shreejitp/Python/blob/master/PythonforDataAnalysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [0]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [0]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

# Filtering Out Missing Data

In [0]:
df = pd.DataFrame(np.random.randn(7, 3))

In [0]:
df

          0         1         2
0 -0.007336 -0.665460 -0.305302
1 -0.743853 -0.286968 -0.463307
2  1.228078  0.868056  1.182486
3  0.745921 -0.905540  1.321364
4  0.870324 -0.569981 -0.382098
5 -0.542978  1.361704 -1.634193
6 -0.039114  0.249017  1.232884

In [0]:
from numpy import nan as NA

In [0]:
df.iloc[:4, 1] = NA

In [0]:
df.iloc[:2, 2] = NA

In [0]:
df

          0         1         2
0 -0.007336       NaN       NaN
1 -0.743853       NaN       NaN
2  1.228078       NaN  1.182486
3  0.745921       NaN  1.321364
4  0.870324 -0.569981 -0.382098
5 -0.542978  1.361704 -1.634193
6 -0.039114  0.249017  1.232884

In [0]:
df.dropna()

          0         1         2
4  0.870324 -0.569981 -0.382098
5 -0.542978  1.361704 -1.634193
6 -0.039114  0.249017  1.232884

**Didn't quite understand the threshold Function **

In [0]:
df.dropna(thresh=1)

          0         1         2
0 -0.007336       NaN       NaN
1 -0.743853       NaN       NaN
2  1.228078       NaN  1.182486
3  0.745921       NaN  1.321364
4  0.870324 -0.569981 -0.382098
5 -0.542978  1.361704 -1.634193
6 -0.039114  0.249017  1.232884

Using fillna with a dictionary to fill different values for each column

In [0]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.007336  0.500000  0.000000
1 -0.743853  0.500000  0.000000
2  1.228078  0.500000  1.182486
3  0.745921  0.500000  1.321364
4  0.870324 -0.569981 -0.382098
5 -0.542978  1.361704 -1.634193
6 -0.039114  0.249017  1.232884

In [0]:
df = pd.DataFrame(np.random.randn(6, 3))

In [0]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [0]:
df

          0         1         2
0 -1.056302 -1.520808 -0.326083
1 -0.535651  1.365610 -1.369513
2 -0.481211       NaN  0.201120
3  1.460152       NaN  0.982559
4 -0.133138       NaN       NaN
5  0.417222       NaN       NaN

In [0]:
df.fillna(method='ffill')

          0         1         2
0 -1.056302 -1.520808 -0.326083
1 -0.535651  1.365610 -1.369513
2 -0.481211  1.365610  0.201120
3  1.460152  1.365610  0.982559
4 -0.133138  1.365610  0.982559
5  0.417222  1.365610  0.982559

In [0]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.056302 -1.520808 -0.326083
1 -0.535651  1.365610 -1.369513
2 -0.481211  1.365610  0.201120
3  1.460152  1.365610  0.982559
4 -0.133138       NaN  0.982559
5  0.417222       NaN  0.982559

# Removing Duplicates of Data

In [0]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
       ....:                      'k2': [1, 1, 2, 3, 3, 4, 4]})

In [0]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [0]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [0]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [0]:
data['v1'] = range(7)

In [0]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [0]:
#dropping duplicates based on only one column value 
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [0]:
#By default the first dup value is retained. IF you want to retain the last one, use the keep argument 
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [0]:
#First instance is kept when the keep argument is not used 
data.drop_duplicates(['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

Transforming Data Using Mapping

In [0]:
import pandas as pd
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [0]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [0]:
meat_to_animal = {
      'bacon': 'pig',
      'pulled pork': 'pig',
      'pastrami': 'cow',
      'corned beef': 'cow',
      'honey ham': 'pig',
      'nova lox': 'salmon'
}

In [0]:
meat_to_animal

{'bacon': 'pig',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon',
 'pastrami': 'cow',
 'pulled pork': 'pig'}

In [0]:
lowercased = data['food'].str.lower()

In [0]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [0]:
 data['animal'] = lowercased.map(meat_to_animal)

In [0]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

Renaming Axis Indices

In [0]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])

In [0]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

# Discretization and Binning

In [0]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [0]:
bins = [18, 25, 35, 60, 100]

In [0]:
cats = pd.cut(ages, bins)

In [0]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [0]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [0]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [0]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

# Detecting and filtering Outliers

In [0]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [0]:
data

            0         1         2         3
0    0.912945 -0.191623 -0.641915 -0.940461
1    0.025259  0.907404  1.175555 -1.448502
2    1.367461  1.178487 -0.419437  1.276564
3   -1.392942  0.896022  0.341970 -0.795625
4   -1.262437 -0.297475  0.500984  1.454831
5    0.862209  1.514126  1.051779 -0.402963
6   -0.552405 -0.349869  0.220635 -0.027193
7    1.094837  0.652203 -0.394391  0.743143
8   -0.569385 -0.651384  0.117953 -0.113274
9   -0.010964  0.312172  0.883452  0.181186
10   0.838312  0.089850  0.267740 -0.036807
11   1.210540  0.798107 -0.088383 -1.755380
12  -0.739211  0.241730 -0.314594 -1.327429
13  -0.309129  0.317249 -0.119589  0.102519
14   1.237871  0.148716 -1.712180 -1.266106
15   0.631794 -0.282113 -1.375298 -1.249348
16   0.160326 -2.138554 -0.722354 -1.211345
17   1.278189  0.344258 -0.170459  0.801087
18  -1.476872 -0.958656 -0.681096 -0.028633
19   0.246682 -0.152511  2.021612 -0.500639
20  -0.198799 -3.881055 -0.067797  0.856234
21  -1.864440 -0.651253  0.157843 -0.519769
22  -0.325487  0.864404 -0.868143 -0.451320
23   1.452589  0.923719  0.853045  0.410382
24   0.086162  0.363975  1.586818 -0.019577
25  -0.366630  0.567763  1.409944  0.325112
26   0.915885  0.925705 -1.424891 -1.831904
27   1.410528 -0.652023  0.061533  0.436241
28   1.254401 -0.638671  1.351468  0.816337
29   0.246617 -0.441082 -1.163362  1.228879
..        ...       ...       ...       ...
970  1.138795 -1.003303 -1.608044  0.679740
971 -0.332257 -0.861263 -0.148221 -1.414542
972 -0.334125 -1.126341  1.689370 -0.566313
973 -0.590789  0.607059 -1.167513 -1.290724
974 -1.069583  1.287395 -1.458844 -1.088334
975  0.135457  2.585227 -0.323082 -0.373075
976  0.237826  0.858745  0.431960  0.038595
977 -0.720610  0.510954  0.018045 -0.143032
978  0.782716 -0.673453  0.687873 -0.245893
979  0.570036  1.086139 -1.408659  0.584850
980 -0.459601  0.483933  0.539756 -0.423010
981  0.837428 -0.291692 -0.741936 -0.870121
982  1.046989 -0.219444 -1.135951 -0.644242
983 -1.384804  0.410585 -1.400601  0.726715
984 -2.375650  0.351631 -1.434046  2.294309
985  1.638669  2.372271 -0.493506  0.224574
986 -0.389315  1.875626  0.648302 -0.000855
987  0.098400 -0.962063 -0.532223  0.192789
988 -0.933123  0.190122  0.017303 -0.765925
989  0.022199 -0.591767 -2.021417  1.086621
990  0.397231  1.371249  2.141701 -0.028256
991 -1.165384 -0.535489 -0.563895 -0.179917
992 -1.684748  0.731084  1.696054  1.773908
993  0.263748  1.004180  0.160376 -0.060166
994 -0.006273 -1.084055 -0.568617 -1.412879
995  1.106993  0.024603 -0.565043  1.964266
996 -0.937684  0.373494  0.912036  1.172949
997  0.274688  0.380510 -0.935758 -1.367342
998  0.174979 -1.109531  0.028614  0.553131
999  0.005277  0.143856 -0.116177 -1.864260

[1000 rows x 4 columns]

# Permutation and Random Sampling

In [0]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [0]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [0]:
sampler = np.random.permutation(5)

In [0]:
sampler

array([1, 2, 3, 0, 4])

In [0]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [0]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7